---
type: ModelText
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# ModelText

`Autodesk.Revit.DB.ModelText` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetVisibility | — | `public FamilyElementVisibility GetVisibility ()` |
| Method | SetVisibility | — | `public void SetVisibility ( FamilyElementVisibility visibility )` |
| Property | Depth | — | `public double Depth { get ; set ; }` |
| Property | HorizontalAlignment | — | `public HorizontalAlign HorizontalAlignment { get ; set ; }` |
| Property | Location | — | `public override Location Location { get ; }` |
| Property | ModelTextType | — | `public ModelTextType ModelTextType { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Subcategory | — | `public Category Subcategory { get ; set ; }` |
| Property | Text | — | `public string Text { get ; set ; }` |